{
  "lang": "en",
  "navbar": {
    "list": ["HOME", "ABOUT", "SKILLS", "PROJECTS", "CV", "CONTACT"],
    "description": "Let's build something unique together",
    "contact-description": "LET'S CONNECT"
  },
  "main": {
    "above-text": "LET'S BUILD SOMETHING TOGETHER",
    "title": {
      "greeting": "Hi, I'm",
      "name": "Mateusz",
      "position": "A Front-End Web Developer"
    },
    "description": "I’m focused on building responsive front-end web applications integrating back-end technologies."
  },
  "about": {
    "above-text": "ABOUT",
    "title": "Who I Am",
    "description": [
      "I am a self-taught developer focused on programming applications that combine front-end and back-end, and my interests are mainly focused on technologies such as React, Next.js, TypeScript, Node, Express, MongoDB and MySQL. Eventually I would like to become a full-stack developer.",
      "I have experience in creating projects where I have used my skills. During my education I created several applications that helped me improve my programming skills."
    ],
    "button-text": "Check out some of my latest projects."
  },
  "skills": {
    "above-text": "SKILLS",
    "title": "What I Can Do"
  },
  "projects": {
    "above-text": "PROJECTS",
    "title": "What I've Built",
    "projects": ["GymGuru App", "Techcards App", "Portfolio App", "ZOL App"],
    "button-text": "More info"
  },
  "contact": {
    "above-text": "CONTACT",
    "title": "Get In Touch",
    "full-name": "Mateusz",
    "position": "Front-End Developer",
    "job-status": "I am available for full-time positions. Contact me and let's talk.",
    "contact-description": "CONNECT WITH ME",
    "form": {
      "name": "NAME",
      "phone": "PHONE",
      "email": "EMAIL",
      "subject": "SUBJECT",
      "message": "MESSAGE",
      "button-text": "Send Message"
    }
  },
  "projects-info": {
    "above-text": "Project",
    "title": "Overview",
    "code-button": "CODE",
    "demo-button": "DEMO",
    "back-button": "Back",
    "technology-list-title": "Technologies",
    "gymguru": {
      "name": "GymGuru",
      "main-technologies": "Javascript, Node",
      "all-technologies": [
        "Javascript",
        "Node",
        "Express",
        "EJS",
        "MongoDB",
        "SCSS"
      ],
      "description": [
        "This was my first full website, which was both a culmination and a practical test of my newly acquired skills. I used pure JavaScript to build it, along with EJS and SCSS for the frontend, Node + Express for the server and MongoDB for the database. It's a site that mimics the website of a city gym, where you can check out the gym's current offerings, find its location, and get in touch. It is also possible to create and personalise your own account."
      ],
      "short-description": "This is my first full website, using pure JavaScript, EJS and SCSS for the frontend, Node + Express for the server and MongoDB for the database. The site mimics a city gym, allowing you to check current offers, location, contact and create your own account with personalisation."
    },
    "techcards": {
      "name": "Techcards",
      "main-technologies": "React, Node",
      "all-technologies": ["React", "Node", "Express", "MySql", "SCSS"],
      "description": [
        "This website is my second project and the first to be built using React. It is by far my biggest project so far, for which I used SCSS, Node + Express to build the server and MySql for the database in addition to React. It's a site for learning through fiches, users have the possibility to create their own fiches and use different learning options like typing, quiz, i know/i don't know mode and much more. It has a panel of created courses with fiches, divided into free and premium fiches, which can be accessed after buying a premium account. It intelligently calculates repetitions. It has full learning statistics to help track the learning progress available to the user, as well as a monthly ranking of user activity, it has many features to make learning easier. It has a working newsletter. The site also generates invoices for premium accounts."
      ],
      "short-description": "This is my second project, a site for learning through fiches with course panels and features to facilitate learning. Full learning statistics, monthly user activity ranking, newsletter, sales invoices. Developed in React, SCSS, Node + Express, with MySql database."
    },
    "portfolio": {
      "name": "Portfolio",
      "main-technologies": "Next",
      "all-technologies": ["Next", "Typescript", "Tailwind"],
      "description": [
        "This is my third project, it is a portfolio to easily access my projects and showcase my skills, I built it using Next.js along with Typescript and Tailwind. It was a great project for me to learn about these technologies. It has the ability to change the language from Polish to English and change the theme to dark."
      ],
      "short-description": "This is my third project, a portfolio of my skills and designs, built using Next.js, Typescript and Tailwind. It has the option to change the language and theme to dark."
    },
    "zol": {
      "name": "Care and Medical Facility in Koprzywnicy",
      "main-technologies": "Next",
      "all-technologies": [
        "Next",
        "Typescript",
        "Tailwind",
        "Google Analytics"
      ],
      "description": [
        "The website zol-koprzywnica.pl is my fourth project and also my first commercial project. It was created using Next.js, TypeScript, Tailwind and Google Analytics tool to measure traffic to the site. The site has a dark and light theme, which allows users to change the look of the site according to their preferences.",

        "The website was created for the Care and Treatment Facility in Koprzywnica, and consists of a number of sub-pages that are dedicated to people interested in staying at this facility. On the site you can find descriptions of services, find answers to frequently asked questions, download documents and easily contact this company. In addition, the site also includes sub-pages describing events that have taken place at this company over the years.",

        "I learnt a lot while working on this project. One of them was how to implement the Google Analytics tool, which allowed me to measure traffic to the site. I also learned how to create a privacy policy and how to implement a domain for the site. While working on the project, I paid particular attention to the principles of SEO and accessibility, which allowed me to create a website that was more accessible to web users and improve its positioning.",

        "Working on the zol-koprzywnica.pl project also allowed me to learn how to create projects in a more commercial way, taking into account the client's needs. It was my first contact with a client, which allowed me to gain valuable experience and learn to understand their needs and adapt the project to their expectations."
      ],
      "short-description": "Zol-koprzywnica.pl is my first commercial website, built in Next.js, TypeScript and Tailwind with Google Analytics. The site contains descriptions of services, documents, events and a contact form for the Care and Treatment Centre in Koprzywnica. I learnt a lot while working on the site, including implementing the Google Analytics tool, privacy policy, domain, SEO principles and accessibility. The project taught me how to create pages for clients and adapt them to their needs."
    }
  }
}
