{
  "lang": "pl",
  "navbar": {
    "list": [
      "STRONA GŁÓWNA",
      "O MNIE",
      "UMIEJĘTNOŚCI",
      "PROJEKTY",
      "CV",
      "KONTAKT"
    ],
    "description": "Zbudujmy razem coś wyjątkowego",
    "contact-description": "Skontaktujmy się"
  },
  "main": {
    "above-text": "ZBUDUJMY COŚ RAZEM",
    "title": {
      "greeting": "Cześć, Jestem",
      "name": "Mateusz",
      "position": "Front-End Web Developer"
    },
    "description": "Skupiam się na tworzeniu responsywnych aplikacji front-end zintegrowanych z back-endem"
  },
  "about": {
    "above-text": "O MNIE",
    "title": "Kim Jestem",
    "description": [
      "Jestem samoukiem skupionym na programowaniu aplikacji łączących front-end z back-endem, a moje zainteresowania skupiają się głównie na technologiach takich jak React, Next.js, TypeScript, Node, Express, MongoDB i MySQL. Docelowo chciałbym zostać full-stack developerem",
      "Posiadam doświadczenie w tworzeniu projektów, w których wykorzystywałem swoje umiejętności. W trakcie mojej edukacji stworzyłem kilka aplikacji, które pomogły mi doskonalić swoje umiejętności w programowaniu."
    ],
    "button-text": "Sprawdź kilka moich ostatnich projektów."
  },
  "skills": {
    "above-text": "UMIEJĘTNOŚCI",
    "title": "Poznane technologie"
  },
  "projects": {
    "above-text": "PROJEKTY",
    "title": "Co stworzyłem",
    "projects": ["GymGuru", "Techcards", "Portfolio", "ZOL"],
    "button-text": "Więcej informacji"
  },
  "contact": {
    "above-text": "KONTAKT",
    "title": "Skontaktuj się ze mną",
    "full-name": "Mateusz",
    "position": "Front-End Developer",
    "job-status": "Jestem dostępny na stanowiska w pełnym wymiarze godzin. Skontaktuj się ze mną i porozmawiajmy.",
    "contact-description": "Skontaktujmy się",
    "form": {
      "name": "IMIĘ",
      "phone": "TELEFON",
      "email": "EMAIL",
      "subject": "TEMAT",
      "message": "WIADOMOŚĆ",
      "button-text": "Wyślij wiadomość"
    }
  },
  "projects-info": {
    "above-text": "Projekt",
    "title": "Opis",
    "code-button": "KOD",
    "demo-button": "DEMO",
    "back-button": "Powrót",
    "technology-list-title": "Technologie",
    "gymguru": {
      "name": "GymGuru",
      "main-technologies": "Javascript, Node",
      "all-technologies": [
        "Javascript",
        "Node",
        "Express",
        "EJS",
        "MongoDB",
        "SCSS"
      ],
      "description": "To była moja pierwsza pełnoprawna strona internetowa, która była zwieńczeniem, jak i sprawdzeniem moich pierwszych zdobytych umiejętności w praktyce. Użyłem do jej stworzenia czystego JavaScript-a wraz z EJS i SCSS do stworzenia frontendu, Node + Express do stworzenia serwera oraz MongoDB jako bazy danych. Jest to strona imitująca stronę miejskiej siłowni, na której można sprawdzić aktualną ofertę siłowni, sprawdzić jej lokalizację i skontaktować się z nią. Istnieje również możliwość założenia własnego konta i personalizacji."
    },
    "techcards": {
      "name": "Techcards",
      "main-technologies": "React, Node",
      "all-technologies": ["React", "Node", "Express", "MySql", "SCSS"],
      "description": "Ta strona jest moim drugim projektem, jak i zarazem pierwszym stworzonym przy użyciu Reacta. Jest to jak na razie mój największy projekt do którego stworzenia oprócz Reacta użyłem również SCSS, Node + Express do tworzenia serwera oraz MySql jako bazy danych. Jest to strona która służy do nauki poprzez fiszki, Użytkownicy mają możliwość tworzenia własnych fiszek i korzystania z różnych opcji nauki, takich jak wpisywanie, quiz, tryb wiem/nie wiem i wiele więcej. posiada panel ze stworzonymi kursami przy użyciu fiszek, które są podzielone na fiszki bezpłatne i premium do których można uzyskać dostęp po kupnie konta premium. W inteligentny sposób oblicza powtórki. Posiada pełne statystyki nauki pomocne w śledzeniu postępów nauki dostępne użytkownikowi a także miesięczny ranking aktywności użytkowników, posiada wiele funkcjonalności ułatwiających naukę. Posiada działający newsletter. Strona generuje także faktury sprzedaży kont premium."
    },
    "portfolio": {
      "name": "Portfolio",
      "main-technologies": "Next",
      "all-technologies": ["Next", "Typescript", "Tailwind"],
      "description": "Jest to mój trzeci projekt, jest to portfolio umożliwiające łatwy dostęp do moich projektów i pokazujące moje umiejętności, zbudowałem go przy użyciu Next.js wraz z Typescript i Tailwind. Był to dla mnie wspaniały projekt, który pozwolił mi na poznanie tych technologii. Posiada możliwość zmiany języka z polskiego na angielski oraz zmiany motywu na ciemny."
    },
    "zol": {
      "name": "Zol",
      "main-technologies": "Wkrótce",
      "all-technologies": ["Wkrótce"],
      "description": "Wkrótce"
    }
  },
  "cv": {
    "left-side": {
      "contact": "Kontakt",
      "personal-skills-title": "Umiejętności",
      "hobbies-title": "Zainteresowania",
      "hobbies": ["Siłownia", "Dietetyka", "Inwestowanie"]
    },
    "right-side": {
      "about-me-title": "O mnie",
      "about-me": "Jestem samoukiem skupionym na programowaniu aplikacji łączących front-end z back-endem, a moje zainteresowania skupiają się głównie na technologiach takich jak React, Next.js, TypeScript, Node, Express, MongoDB i MySQL. Docelowo chciałbym zostać full-stack developerem"
    }
  }
}
